{
  "name": "Keyboard Eccomerce",
  "overview": "The keyboard eccomerce project is a keyboard e-commerce application developed using React. The goal of the project is to create a web application or website that allows users to browse, search, and purchase keyboards online.",
  "img": "https://res.cloudinary.com/dkarsw8bs/image/upload/v1686833570/md/keyboard_eccomrce/Main.png",
  "site": "https://keyboard-eccomerce.onrender.com/",
  "github": "https://github.com/Shoon23/keyboard_eccomerce",
  "techStack": [
    "Typescript",
    "React",
    "Zustand",
    "Nodejs",
    "Expressjs",
    "Prisma",
    "MySQL",
    "Stripe",
    "Cloudinary",
    "Tailwindcss"
  ],
  "features": [
    {
      "title": "Product Management",
      "items": [
        {
          "title": "Product Listing",
          "image": "https://res.cloudinary.com/dkarsw8bs/image/upload/v1686799037/md/keyboard_eccomrce/Listing.png",
          "description": "The \"keyboard_eccomerce\" project includes a product listing feature that displays all available keyboard products. Users can browse through the list, view product details, and make informed purchasing decisions. This feature provides a centralized view of the products, enhancing the user experience and facilitating product exploration."
        },
        {
          "title": "Create",
          "image": "https://res.cloudinary.com/dkarsw8bs/image/upload/v1686798649/md/keyboard_eccomrce/Create.png",
          "description": "Creating a product enables users to add new keyboard items to the platform, providing details such as the product name, description, price, and images. This allows sellers to showcase their keyboard offerings and make them available to potential buyers."
        },
        {
          "title": "Update",
          "image": "https://res.cloudinary.com/dkarsw8bs/image/upload/v1686799118/md/keyboard_eccomrce/Update.png",
          "description": "Updating a product allows users to modify the information associated with a product. They can edit the product's details, update the price, description, or add/remove images. This feature ensures that product information stays up to date and accurately reflects the available keyboard items."
        },
        {
          "title": "Delete",
          "image": "https://res.cloudinary.com/dkarsw8bs/image/upload/v1686799243/md/keyboard_eccomrce/Delete.png",
          "description": "Deleting a product enables users to remove a product from the platform. This action is useful when a product is no longer available for sale or is no longer relevant. By deleting a product, users can keep the product catalog organized and ensure that only active and relevant products are displayed to buyers."
        }
      ]
    },
    {
      "title": "User Review",
      "items": [
        {
          "title": "Create Review",
          "image": "https://res.cloudinary.com/dkarsw8bs/image/upload/v1686799393/md/keyboard_eccomrce/User%20Review.png",
          "description": "The \"User Reviews\" feature in the \"keyboard_eccomerce\" project allows users to share their feedback and opinions about products. Users can leave reviews or ratings for the products they have purchased or experienced. This feature provides valuable insights to other users who are considering buying the same product. By reading these reviews, potential buyers can make informed decisions based on the experiences and feedback shared by other users."
        }
      ]
    },
    {
      "title": "User Authentication",
      "items": [
        {
          "title": "Login",
          "image": "https://res.cloudinary.com/dkarsw8bs/image/upload/v1686799579/md/keyboard_eccomrce/Login.png",
          "description": "Registered users can log in to their accounts using their credentials (username/email and password). This grants them access to their profile, cart management, and the ability to like products."
        },
        {
          "title": "Register",
          "image": "https://res.cloudinary.com/dkarsw8bs/image/upload/v1686799582/md/keyboard_eccomrce/Register.png",
          "description": "Users can create an account by providing their details, such as username, email, and password. This allows them to access personalized features and functionalities within the application."
        }
      ]
    },
    {
      "title": "Payment Integration",
      "items": [
        {
          "title": "Stripe",
          "image": "https://res.cloudinary.com/dkarsw8bs/image/upload/v1686800035/md/keyboard_eccomrce/Stripe.png",
          "description": "The project seamlessly integrates the Stripe payment platform to securely process purchases made on the platform, ensuring a smooth and safe payment experience for users."
        }
      ]
    },
    {
      "title": "Cart System",
      "items": [
        {
          "title": "Add",
          "image": "https://res.cloudinary.com/dkarsw8bs/image/upload/v1686800038/md/keyboard_eccomrce/Add%20To%20Cart.png",
          "description": "The \"Add\" functionality within the cart allows users to include products of their choice to their shopping cart. This means that when users come across a product they are interested in, they can click on an \"Add to Cart\" button or similar action, and the selected item will be placed in their cart."
        },
        {
          "title": "Remove",
          "image": "https://res.cloudinary.com/dkarsw8bs/image/upload/v1686800182/md/keyboard_eccomrce/Delete%20Cart%20Item.png",
          "description": "The \"Remove\" functionality enables users to delete or eliminate items from their cart. If users change their mind about a particular product or no longer wish to purchase it, they can click on a \"Remove\" button or a corresponding action to remove the item from their cart. This helps users refine their selections and ensures that the cart only contains the desired products for purchase."
        }
      ]
    },
    {
      "title": "Bookmark Or Like Product",
      "items": [
        {
          "title": "List Like Products",
          "image": "https://res.cloudinary.com/dkarsw8bs/image/upload/v1686800437/md/keyboard_eccomrce/List%20Liked.png",
          "description": "The feature enables users to view their list of liked products."
        },
        {
          "title": "Add Like Products",
          "image": "https://res.cloudinary.com/dkarsw8bs/image/upload/v1686800439/md/keyboard_eccomrce/Add%20Liked.png",
          "description": "Allows users to add products they are interested in to a liked list."
        },
        {
          "title": "Remove Like Products",
          "image": "https://res.cloudinary.com/dkarsw8bs/image/upload/v1686800437/md/keyboard_eccomrce/Remove%20Liked.png",
          "description": "Users can remove products from their liked list if they change their preferences."
        }
      ]
    }
  ],
  "responsive": "https://res.cloudinary.com/dkarsw8bs/image/upload/v1686834611/md/keyboard_eccomrce/Responsive.png"
}
